{
  "users": [
    {
      "id": 1,
      "email": "nguyenvana@gmail.com",
      "password": "1234567",
      "fullName": "Nguyễn Văn A",
      "sex": "2",
      "age": "26"
    },
    {
      "id": 2,
      "email": "tranthib@gmail.com",
      "password": "1234567",
      "fullName": "Trần Thị B",
      "sex": "2",
      "age": "30"
    }
  ],
  "schedules": [
    {
      "id": 555,
      "date": "2023-12-01",
      "reminds": [
        {
          "id": 1,
          "time": "12:00",
          "text": "Meeting at 10am",
          "scheduleId": 555
        }
      ],
      "userEmail": "nguyenvana@gmail.com"
    },
    {
      "id": 666,
      "date": "2023-12-12",
      "reminds": [
        {
          "id": 2,
          "time": "12:00",
          "text": "Lunch with colleagues",
          "scheduleId": 666
        },
        {
          "id": 3,
          "time": "12:00",
          "text": "Shopping",
          "scheduleId": 666
        }
      ],
      "userEmail": "nguyenvana@gmail.com"
    },
    {
      "id": 777,
      "date": "2023-12-13",
      "reminds": [
        {
          "id": 4,
          "time": "12:00",
          "text": "Gym at 5pm",
          "scheduleId": 777
        }
      ],
      "userEmail": "tranthib@gmail.com"
    },
    {
      "id": 888,
      "date": "2023-12-14",
      "diaries": [
        {
          "id": 5,
          "sick": "Cao huyết áp",
          "symptoms": "Nhức đầu",
          "description": "Đau hoài",
          "scheduleId": 888
        }
      ],
      "userEmail": "nguyenvana@gmail.com"
    },
    {
      "id": 999,
      "date": "2023-12-24",
      "diaries": [
        {
          "id": 5,
          "sick": "Cao huyết áp",
          "symptoms": "Nhức đầu",
          "description": "Đau hoài",
          "scheduleId": 888
        }
      ],
      "userEmail": "nguyenvana@gmail.com"
    },
    {
      "id": 9999,
      "date": "2023-12-28",
      "diaries": [
        {
          "id": 5,
          "sick": "Cao huyết áp",
          "symptoms": "Nhức đầu",
          "description": "Đau hoài",
          "scheduleId": 888
        }
      ],
      "userEmail": "nguyenvana@gmail.com"
    }
  ],
  "sicks": [
    {
      "id": 1,
      "name": "Đột quỵ",
      "images": "https://www.vinmec.com/s3-images/size/xxlarge/20190507_023137_612349_tac-nghen-mach-mau.max-1800x1800.jpg",
      "reason": "Có rất nhiều yếu tố làm tăng nguy cơ bị đột quỵ, bao gồm các yếu tố không thể thay đổi và các yếu tố bệnh lý.\n1. Các yếu tố không thể thay đổi\nTuổi tác: Bất cứ ai cũng có nguy cơ bị đột quỵ. Tuy nhiên, người già có nguy cơ đột quỵ cao hơn người trẻ. Kể từ sau tuổi 55, cứ mỗi 10 năm, nguy cơ bị đột quỵ lại tăng lên gấp đôi.\nGiới tính: Nam giới có nguy cơ bị đột quỵ cao hơn nữ giới.\nTiền sử gia đình: Người có người thân trong gia đình từng bị đột quỵ có nguy cơ bị đột quỵ cao hơn người bình thường.\nChủng tộc: Người Mỹ gốc Phi có nguy cơ mắc đột quỵ cao gần gấp đôi so với người da trắng.\n2. Các yếu tố bệnh lý\nTiền sử đột quỵ: Người có tiền sử bị đột quỵ có nguy cơ cao bị đột quỵ lần tiếp theo, nhất là trong vòng vài tháng đầu. Nguy cơ này kéo dài khoảng 5 năm và giảm dần theo thời gian.\nĐái tháo đường: Các vấn đề liên quan đến đái tháo đường có khả năng làm tăng nguy cơ đột quỵ.\nBệnh tim mạch: Người mắc các bệnh lý tim mạch có khả năng bị đột quỵ cao hơn người bình thường\nCao huyết áp: Cao huyết áp gây gia tăng sức ép lên thành động mạch, lâu dần khiến thành động mạch bị tổn thương dẫn đến xuất huyết não. Ngoài ra, cao huyết áp còn tạo điều kiện cho các cục máu đông hình thành, cản trở quá trình lưu thông máu lên não. Khám huyết áp là một trong những biện pháp để tìm ra nguyên nhân đột quỵ.\nMỡ máu: Cholesterol cao có thể tích tụ trên thành động mạch, tạo thành vật cản gây tắc nghẽn mạch máu não.\nThừa cân, béo phì: Người bị thừa cân béo phì có thể dẫn đến nhiều bệnh như cao huyết áp, mỡ máu, tim mạch. Tăng nguy cơ bị đột quỵ.\nHút thuốc: Các nghiên cứu đã chỉ ra rằng, người hút thuốc có nguy cơ bị đột quỵ cao gấp 2 lần. Khói thuốc làm tổn thương thành mạch máu, gia tăng quá trình xơ cứng động mạch. Thuốc lá cũng gây hại cho phổi, khiến tim làm việc nhiều hơn, gây tăng huyết áp.\nLối sống không lành mạnh: Ăn uống không điều độ, không cần bằng đầy đủ các loại dưỡng chất; lười vận động là một trong những nguyên nhân dẫn đến đột quỵ.\nNgoài ra, đột quỵ cũng được cho là có liên quan đến việc sử dụng các chất kích thích, uống quá nhiều rượu...",
      "simpton": "Các dấu hiệu đột quỵ có thể xuất hiện và biến mất rất nhanh, lặp đi lặp lại nhiều lần, bao gồm:\n\nCơ thể mệt mỏi, đột nhiên cảm thấy không còn sức lực, tê cứng mặt hoặc một nửa mặt, nụ cười bị méo mó.\nCử động khó hoặc không thể cử động chân tay, tê liệt một bên cơ thể. Dấu hiệu đột quỵ chính xác nhất là không thể nâng hai cánh tay qua đầu cùng một lúc.\nKhó phát âm, nói không rõ chữ, bị dính chữ, nói ngọng bất thường. Bạn có thể thực hiện phép thử bằng cách nói những câu đơn giản và yêu cầu người bệnh nhắc lại, nếu không thể nhắc lại được thì người bệnh đó đang có những dấu hiệu đột quỵ.\nHoa mắt, chóng mặt, người mất thăng bằng đột ngột, không phối hợp được các hoạt động.\nThị lực giảm, mắt mờ, không nhìn rõ\nĐau đầu dữ dội, cơn đau đầu đến rất nhanh, có thể gây buồn nôn hoặc nôn\nNgười bị đột quỵ có thể có một vài dấu hiệu trên. Tùy thể trạng sức khỏe của mỗi người mà dấu hiệu đột quỵ khác nhau. Ngoài ra, người bệnh có thể gặp cơn thiếu máu não thoáng qua với các triệu chứng giống hệt đột quỵ nhưng chỉ xảy ra trong vòng vài phút. Cơn thiếu máu não thoáng qua là dấu hiệu cảnh báo tình trạng đột quỵ sắp xuất hiện, có thể là trong vòng vài ngày hoặc một tháng sắp tới.\n\nNhững dấu hiệu đột quỵ có thể đến và qua đi rất nhanh. Bạn cần lắng nghe cơ thể, khi thấy các dấu hiệu này xuất hiện cần chủ động đến gặp bác sĩ càng sớm càng tốt để được kiểm tra. Thời gian “vàng” cho bệnh đột quỵ là 60 phút, mỗi phút qua đi, mức độ tổn thương của hệ thần kinh càng nghiêm trọng.",
      "revention": "1. Chế độ dinh dưỡng hợp lý\nNguyên nhân gây bệnh đột quỵ đến từ các bệnh lý tim mạch, đái tháo đường, mỡ máu... Chế độ dinh dưỡng là yếu tố quan trọng quyết định hình thành các bệnh lý này. Ăn uống với chế độ dinh dưỡng hợp lý là cách phòng tránh đột quỵ hiệu quả.\n- Ăn nhiều các loại rau củ quả, các loại đậu, ngũ cốc\n- Ăn nhiều thịt trắng, hải sản, trứng để bổ sung protein cho cơ thể, hạn chế ăn các loại thịt đỏ\n- Hạn chế các loại thực phẩm giàu chất béo, đồ chiên xào, thức ăn nhanh\n- Hạn chế các loại đồ ngọt, thực phẩm chứa nhiều đường\n- Uống nhiều nước lọc, nước trái cây, sữa đậu nành...\n2. Tập thể dục hàng ngày\nTập thể dục giúp tăng cường tuần hoàn máu trong cơ thể, nâng cao sức khỏe, giúp tim khỏe mạnh. Tập thể dục 30 phút mỗi ngày, ít nhất 4 lần mỗi tuần sẽ làm giảm nguy cơ mắc bệnh tim mạch, dẫn đến đột quỵ.\n3. Giữ ấm cơ thể\nNhiễm lạnh có thể gây tăng huyết áp, tăng áp lực khiến mạch máu bị vỡ. Cần giữ ấm cơ thể, giữ gìn sức khỏe, đặc biệt là với người lớn tuổi trong thời điểm giao mùa.\n4. Không hút thuốc lá\nHút là là một trong những nguy cơ làm tăng khả năng bị đột quỵ. Thuốc lá còn gây hại cho sức khỏe của bản thân và những người xung quanh. Nếu bỏ thuốc lá trong vòng từ 2 - 5 năm, nguy cơ bị đột quỵ sẽ ngang bằng với người chưa bao giờ hút thuốc.\n5. Kiểm tra sức khỏe định kỳ\nKiểm tra sức khỏe định kỳ sớm phát hiện các yếu tố gây đột quỵ và chủ động can thiệp sẽ giúp phòng tránh đột quỵ hiệu quả.\nNhững người mắc các bệnh lý đái tháo đường, tim mạch, mỡ máu càng cần đi khám sức khỏe định kỳ để kiểm soát tình trạng bệnh, không để các chỉ số vượt quá mức nguy hiểm gây ra đột quỵ.\nKiểm tra sức khỏe định kỳ là một trong những cách nhận biết sớm và phòng tránh bệnh nhất là đối với những bệnh nhân có tiền sử bị đột quỵ, từ đó có kế hoạch điều trị đạt kết quả tối ưu."
    },
    {
      "id": 2,
      "name": "Viêm phổi",
      "images": "https://tamanhhospital.vn/wp-content/uploads/2021/09/nguyen-nhan-gay-viem-phoi.jpg",
      "reason": "1. Viêm phổi do vi khuẩn\nVi khuẩn là nguyên nhân của hầu hết các trường hợp viêm phổi cộng đồng ở người trưởng thành. Viêm phổi do vi khuẩn thường lây truyền qua đường giọt bắn (khi người khỏe mạnh hít, nuốt phải các giọt chứa đầy vi khuẩn sau khi người mắc bệnh ho hoặc hắt hơi). Những người có hệ miễn dịch suy yếu, những người có các bệnh lý nền mạn tính sẽ dễ bị viêm phổi do vi khuẩn hơn người bình thường.\n2. Viêm phổi do nhiễm virus\nHiện nay, viêm phổi do virus nguy hiểm nhất là virus SARS-CoV-2. Tính đến ngày 4-9-2021, bệnh viêm phổi do virus SARS-CoV-2 đã tấn công toàn cầu, lây nhiễm cho 220 triệu người, trong đó có trên 4.56 triệu người tử vong. Ngoài ra, viêm phổi có thể do nhiều loại virus khác gây cảm lạnh, cúm.\n3. Viêm phổi do nấm\nLoại viêm phổi này do hít phải các bào tử của nấm, hay gặp ở những người có vấn đề sức khỏe mạn tính hoặc hệ thống miễn dịch suy yếu. Viêm phổi do nấm phát triển rất nhanh, các bào tử nấm khi hít phải bám vào phổi. Người hút thuốc lá, sinh sống ở môi trường bụi bẩn, ẩm mốc, dễ mắc bệnh viêm phổi do nấm.4. Viêm phổi do hóa chất\n4. Viêm phổi do hóa chất\nViêm phổi do hóa chất hay còn được gọi là viêm phổi hít. Đây là bệnh viêm phổi rất ít gặp, nhưng mức độ nguy hiểm cao. Viêm phổi do hóa chất xảy ra với nhiều mức độ khác nhau. Mức độ nặng của tình trạng sẽ phụ thuộc vào: loại hóa chất, thời gian phơi nhiễm, thể trạng người bệnh, các biện pháp sơ cứu đã thực hiện… Ngoài ra, các hóa chất gây viêm phổi còn có thể gây hại cho nhiều cơ quan khác.\n5. Viêm phổi bệnh viện\nLà viêm phổi xảy ra sau 48 giờ nhập viện mà trước đó người bệnh không có các triệu chứng của viêm phổi. Viêm phổi bệnh viện thường do những vi khuẩn gây ra là P. aeruginosa, Acinetobacter spp, Enterobacteriacae, Haemophillus spp, S. aureus, Streptococcus spp.\n6. Viêm phổi cộng đồng\nViêm phổi cộng đồng là cách chỉ tất cả các loại viêm phổi mà không phải là viêm phổi bệnh viện. Nguyên nhân gây ra viêm phổi cộng đồng rất đa dạng, thông thường nhất là viêm phổi do vi khuẩn, virus.",
      "simpton": "Các biểu hiện bệnh viêm phổi khác nhau từ nhẹ đến nặng, tùy thuộc vào các yếu tố như loại vi trùng gây viêm phổi, tuổi tác và sức khỏe tổng thể của người bệnh. Các dấu hiệu và triệu chứng nhẹ thường tương tự như cảm lạnh hoặc cúm, nhưng chúng kéo dài hơn.\nCác dấu hiệu và triệu chứng của bệnh viêm phổi có thể bao gồm:\n- Đau ngực khi bạn thở hoặc ho\n- Ho, ho có đờm\n- Mệt mỏi\n- Sốt, đổ mồ hôi và ớn lạnh\n- Ở người già hoặc người suy giảm miễn dịch có thể không sốt\n- Buồn nôn, nôn mửa hoặc tiêu chảy\n- Khó thở\n- Người già có thể lú lẫn\nBệnh viêm phổi ở trẻ sơ sinh và trẻ nhỏ có thể không có bất kỳ dấu hiệu nào cảnh báo viêm phổi. Tuy nhiên, trẻ vẫn có thể có dấu hiệu như:\n- Nôn mửa\n- Sốt cao, co giật\n- Ho\n- Trẻ bứt rứt, mệt mỏi\n- Trẻ khó thở, bỏ bú, bỏ ăn\n- Tím tái, li bì, rút lõm lồng ngực",
      "revention": "1. Tiêm phòng\nHiện nay đã có sẵn các vắc xin để ngăn ngừa một số bệnh viêm phổi, cúm. Đặc biệt, nhóm vắc xin ngừa bệnh viêm phổi cho trẻ được sử dụng rộng rãi. Các bác sĩ khuyến cáo nên chủng ngừa viêm phổi khác cho trẻ em dưới 2 tuổi và trẻ em từ 2 đến 5 tuổi có nguy cơ đặc biệt mắc bệnh phế cầu khuẩn. Để ngừa bệnh này có vắc xin PCV 10, tên thương mại là Synflorix giúp ngừa được 10 chủng vi khuẩn phế cầu khác nhau. Đối với bệnh viêm phổi người lớn, hiện có nhiều loại vắc xin ngừa Covid-19 như: AstraZeneca, Pfizer-BioNTech, Moderna, Johnson & Johnson’s Janssen…\n2. Tăng cường vệ sinh\nĐể bảo vệ bản thân khỏi nhiễm trùng đường hô hấp mà đôi khi dẫn đến viêm phổi, hãy rửa tay thường xuyên hoặc sử dụng chất khử trùng tay có cồn, đeo khẩu trang. Bạn cần súc miệng hằng ngày bằng nước muối hoặc dung dịch sát khuẩn. Thói quen này giúp tiêu diệt vi khuẩn ở cổ họng, làm loãng đờm, khai thông đường thở và hạn chế tối đa các biến chứng do nhiễm khuẩn.\n3. Không hút thuốc chủ động hoặc thụ động\nKhói thuốc lá có khả năng làm hỏng khả năng bảo vệ tự nhiên của phổi chống lại nhiễm trùng đường hô hấp.\n4. Giữ cho hệ thống miễn dịch mạnh mẽ\nCách tăng cường hệ miễn dịch đó là: ngủ đủ giấc, tập thể dục thường xuyên và ăn uống lành mạnh."
    },
    {
      "id": 3,
      "name": "Tăng huyết áp",
      "images": "https://www.vinmec.com/s3-images/20200217_104338_916477_tang-huyet-ap-an-gi.max-800x800.jpg",
      "reason": "Nguyên nhân tăng huyết áp cũng được chia thành hai nhóm\n- Tăng huyết áp vô căn: không xác định được nguyên nhân\n- Tăng huyết áp thứ phát: các nguyên nhân có thể gặp:\n+ Các bệnh lý về thận: viêm cầu thận cấp, viêm cầu thận mạn, sỏi thận, hẹp động mạch thận\n+ Các bệnh nội tiết: U tủy thượng thận, Cushing, cường Aldosteron, cường giáp,..\n+ Các bệnh lý tim mạch: hở van động mạch chủ (gây tăng huyết áp tâm thu đơn độc), hẹp eo động mạch chủ (gây tăng huyết áp chi trên), hẹp xơ vữa động mạch ảnh hưởng đến động mạch thận\n+ Do thuốc: cam thảo, thuốc tránh thai, một số thuốc cường giao cảm\n+ Nguyên nhân khác: ngộ độc thai nghén, rối loạn thần kinh",
      "simpton": "Tăng huyết áp thường không có triệu chứng gì đặc biệt trong một thời gian dài. Đôi khi người bệnh có thể thấy đau đầu, đau ngực, khó thở khi có cơn tăng huyết áp. Hoặc những triệu chứng của tổn thương cơ quan đích: nhìn mờ, đau ngực dữ dội, tiểu máu, liệt nửa người (đột quỵ não)…nhưng khi có những triệu chứng này tiên lượng thường không tốt.",
      "revention": "Chế độ ăn: giảm muối, nhiều rau xanh, ít mỡ động vật thay bằng dầu thực vật\nTập thể dục thường xuyên: ít nhất 30 phút mỗi ngày, 5 ngày mỗi tuần\nBỏ thuốc lá, thuốc lào\nGiảm cân, duy trì chỉ số khối cơ thể (BMI) từ 18,5-22,9 kg/m2\nDuy trì vòng bụng dưới 90cm ở nam và dưới 80cm ở nữ\nHạn chế uống rượu bia\nTránh lo âu, căng thẳng thần kinh, thư giãn nghỉ ngơi hợp lí"
    },
    {
      "id": 4,
      "name": "Đái tháo đường",
      "images": "https://cdn.youmed.vn/tin-tuc/wp-content/uploads/2019/05/dai-thao-duong-2.jpg",
      "reason": "1. Nguyên nhân gây nên tiểu đường tuýp 1\nTiểu đường tuýp 1 do tế bào beta của tuyến tụy bị phá hủy nên người bệnh không còn hoặc còn rất ít insulin, 95% do cơ chế tự miễn (tuýp 1A), do hệ miễn dịch tấn công nhầm và phá hủy các tế bào sản xuất insulin có trong tuyến tụy, khiến bệnh nhân không có hoặc có ít insulin, dẫn đến lượng đường tích lũy trong máu thay vì di chuyển đến các tế bào, 5% không rõ nguyên nhân (tuýp 1B).\nCác yếu tố nguy cơ dẫn đến tiểu đường tuýp 1 vẫn đang trong quá trình nghiên cứu. Tuy nhiên, ghi nhận đa số trường hợp bệnh nhân mắc bệnh thấy rằng, khi thành viên trong gia đình mắc bệnh thì bạn cũng có nguy cơ nhẹ mắc bệnh. Hoặc các yếu tố môi trường, phơi nhiễm với một số loại virus cũng là yếu tố nguy cơ của bệnh.\n2. Nguyên nhân gây nên tiểu đường type 2\nNguyên nhân của bệnh tiểu đường type 2 vẫn chưa được làm rõ, một số trường hợp ghi nhận bệnh có di truyền. Bên cạnh đó, tình trạng thừa cân béo phì cũng có liên hệ chặt chẽ với bệnh, tuy nhiên cần phân biệt không phải ai thừa cân cũng đều mắc bệnh tiểu đường type 2.\nMột số yếu tố nguy cơ có thể dẫn đến tiểu đường type 2 gồm:\nTiền sử gia đình có bố mẹ, anh chị em ruột, con mắc bệnh tiểu đường.\nTiền sử bản thân từng bị tiểu đường thai kỳ.\nTiền sử bệnh tim mạch do xơ vữa động mạch\nTăng huyết áp.\nÍt hoạt động thể lực\nThừa cân, béo phì.\nBị rối loạn dung nạp đường hay rối loạn đường huyết đói\nPhụ nữ bị hội chứng buồng trứng đa nang\nnguyên nhân bệnh đái tháo đường\n3. Nguyên nhân gây nên tiểu đường thai kỳ\nKhi mang thai, nhau thai sẽ tạo ra những kích thích để duy trì thai kỳ. Những kích thích này sẽ làm cho tế bào tăng khả năng kháng insulin. Bình thường, tuyến tụy sẽ sản xuất đủ insulin để vượt qua sức đề kháng này, tuy nhiên một số trường hợp tuyến tụy không sản xuất đủ lượng insulin cần thiết khiến lượng đường vận chuyển vào tế bào giảm, lượng đường tích tụ lại trong máu tăng cao, dẫn đến tiểu đường thai kỳ.\nPhụ nữ mang thai bị thừa cân, có tiền sử gia đình mắc bệnh tiểu đường hoặc đã được chẩn đoán bị rối loạn dung nạp glucose đều có nguy cơ cao bị tiểu đường thai kỳ.",
      "simpton": "Các dấu hiệu nhận biết của bệnh tiểu đường thay đổi ít nhiều theo tuýp bệnh tiểu đường, đôi khi rất nhẹ, thậm chí không có triệu chứng rõ ràng khiến người bệnh khó phát hiện bản thân mắc bệnh, mãi đến khi bệnh có những biến chứng mới bắt đầu thăm khám và được điều trị.\n1. Triệu chứng của tiểu đường tuýp 1\nCác triệu chứng của thể tiểu đường tuýp 1 thường diễn tiến nhanh, có thể xuất hiện vài ngày hoặc vài tuần với các biểu hiện điển hình gồm:\n- Cảm thấy đói và mệt: Thông thường, cơ thể sẽ chuyển đổi thực phẩm ăn vào thành glucose để các tế bào lấy năng lượng. Các tế bào sẽ cần đến insulin để có thể hấp thụ glucose, tuy nhiên, khi cơ thể không tạo ra đủ lượng insulin cần thiết, hoặc các tế bào của cơ thể kháng lại insulin được tạo ra sẽ khiến glucose không thể hấp thu và lấy năng lượng. Chính điều này khiến bệnh nhân sẽ cảm thấy đói và mệt mỏi hơn so với bình thường.\n- Thường xuyên khát nước, đi tiểu nhiều: Người bình thường sẽ mất khoảng 4 – 7 lần đi tiểu trong vòng 24 giờ, nhưng ở bệnh nhân tiểu đường tuýp 1 sẽ đi tiểu nhiều lần hơn. Lý do xuất phát từ việc ở cơ chế bình thường, cơ thể sẽ tái hấp thu glucose khi đi qua thận, còn ở bệnh nhân tiểu đường, lượng glucose trong máu bị đẩy lên cao khiến thận không thể hấp thu tất cả trở lại. Kết quả là glucose sẽ được thải qua đường tiểu kéo theo thải nước, khiến cơ thể tạo nhiều nước tiểu, bệnh nhân đi tiểu thường xuyên hơn. Khi đi tiểu nhiều gây ra tình tình trạng mất nước, bệnh nhân sẽ rất khát do đó sẽ cần uống nước, nhưng chính vì vậy lại càng đi tiểu nhiều hơn.\n- Khô miệng, ngứa da: Bệnh nhân sẽ đi tiểu nhiều hơn khiến cơ thể bị mất nước, làm cho vùng miệng cảm thấy bị khô. Đồng thời, da khô có thể khiến bệnh nhân tiểu đường bị ngứa da.\n- Sụt cân: Một số trường hợp bệnh nhân ăn nhiều nhưng vẫn sụt cân sau vài tuần lễ do mất nước, do ly giải mô mỡ, mô cơ.\n2. Triệu chứng của tiểu đường tuýp 2\nỞ thể tiểu đường tuýp 2, các triệu chứng tiến triển âm thầm và phát triển trong nhiều năm, hầu hết bệnh nhân không gặp những triệu chứng rõ ràng như thể tiểu đường tuýp 1 nên khó phát hiện. Bệnh có thể vô tình được phát hiện qua xét nghiệm glucose máu hoặc có những biến chứng như vết thương nhiễm trùng lâu lành. Một số dấu hiệu nghi ngờ cần thăm khám và làm các xét nghiệm cần thiết để chẩn đoán chính xác bệnh tiểu đường gồm:\n- Nhiễm trùng nấm men: Cả hai giới đều có thể gặp phải tình trạng này nếu mắc bệnh tiểu đường. Nấm men sẽ ăn glucose, do đó sự tập trung nhiều glucose sẽ khiến nấm phát triển mạnh. Bệnh nhân có thể thấy nhiễm trùng ở bất kỳ nếp gấp ẩm của da, ở giữa ngón tay, ngón chân, vùng dưới ngực, thậm chí xung quanh hoặc trong cơ quan sinh dục.\n- Vết thương chậm lành: Lượng đường trong máu quá cao có thể sẽ ảnh hưởng đến lưu lượng máu của toàn bộ cơ thể, gây tổn thương hệ thần kinh, khiến khó chữa lành các vết thương. Bên cạnh đó, bệnh nhân có thể thấy đau hoặc tê ở chân. Đó cũng chính là biểu hiện của tổn thương thần kinh.\n3. Triệu chứng của tiểu đường thai kỳ\nPhụ nữ mang thai bị tiểu đường thai kỳ thường không có triệu chứng rõ ràng. Sản phụ có thể sẽ khát nước hơn bình thường, thường xuyên đi tiểu hơn. Bệnh thường được chẩn đoán ở 3 tháng giữa hoặc 3 tháng cuối thai kỳ nhờ thực hiện nghiệm pháp dung nạp glucose 3 mẫu lúc thai 24 – 28 tuần tuổi, trước đó chưa ghi nhận bệnh tiểu đường tuýp 1 hoặc tuýp 2.",
      "revention": "Không thể phòng ngừa được bệnh tiểu đường tuýp 1, nhưng bệnh nhân hoàn toàn có thể giảm bớt nguy cơ bệnh tiến triển thành tiểu đường tuýp 2 bằng cách điều chỉnh chế độ ăn uống hàng ngày, có kế hoạch tập luyện thể chất đều đặn, hợp lý.\n1. Chăm sóc bệnh nhân tiểu đường\n1.1. Chế độ ăn uống\nChế độ ăn uống đóng vai trò cực kỳ quan trọng, giúp bệnh nhân tiểu đường kiểm soát bệnh.\nNguyên tắc cơ bản trong chế độ ăn bệnh tiểu đường: đảm bảo cung cấp đủ dinh dưỡng, không làm tăng đường huyết nhiều sau ăn, không làm hạ đường huyết xa bữa ăn nhằm duy trì hoạt động thể lực bình thường và duy trì cân nặng hợp lý.\nThiết kế bữa ăn đơn giản, không quá đắt tiền và phù hợp với tập quán địa phương.\nCân bằng tỷ lệ carbohydrate, protein và chất béo; bổ sung những loại thực phẩm giàu dinh dưỡng, ít chất béo và calo như rau củ, trái cây, các loại ngũ cốc nguyên hạt; theo dõi đường huyết sau bữa ăn… Bệnh nhân có thể tham khảo ý kiến của bác sĩ hoặc các chuyên gia dinh dưỡng để được hướng dẫn chế độ ăn uống thích hợp.\n1.2. Vận động\nViệc vận động không chỉ giúp giảm chỉ số đường huyết, duy trì cân nặng ở mức ổn định mà còn giúp giảm nguy cơ bệnh tim mạch…Khuyến cáo bệnh nhân tiểu đường tập thể dục thể thao ít nhất 5 ngày mỗi tuần với thời gian tập 30 phút mỗi ngày, bệnh nhân có thể tham khảo ý kiến bác sĩ để được hướng dẫn bài tập phù hợp."
    },
    {
      "id": 5,
      "name": "Bệnh phổi tắc nghẽn mãn tính",
      "images": "https://www.vinmec.com/s3-images/size/xxlarge/20190420_074346_899630_image2.max-1800x1800.jpg",
      "reason": "Bệnh phổi tắc nghẽn mãn tính (COPD) xảy ra khi phổi bị viêm, tổn thương và hẹp đường dẫn khí. Nguyên nhân chính là do hút thuốc, mặc dù tình trạng này đôi khi có thể xảy ra ở những người chưa bao giờ hút thuốc, ví dụ như những bệnh nhân mắc bệnh giãn phế quản, hen, di chứng lao phổi...)\n\nThực tế, việc hút thuốc lá càng nhiều và thời gian càng dài thì khả năng mắc bệnh phổi tắc nghẽn càng cao. Một số trường hợp COPD là do tiếp xúc lâu dài với khói hoặc bụi có hại. Những người khác là kết quả của một vấn đề di truyền hiếm gặp, có nghĩa là phổi dễ bị tổn thương hơn.",
      "simpton": "Các triệu chứng chính của COPD là:\n\nTăng khó thở, đặc biệt là khi người bệnh hoạt động\nHo khan dai dẳng có đờm - một số người có thể coi đây chỉ là \"ho của người hút thuốc\"\nNhiễm trùng ngực thường xuyên\nKhò khè liên tục\nNếu không điều trị, các triệu chứng của bệnh thường tiến triển nặng hơn. Cũng có thể có những giai đoạn khi chúng trở nên tồi tệ hơn, được gọi là đợt cấp hoặc đợt bùng phát.",
      "revention": "COPD phần lớn là một bệnh có thể phòng ngừa được. Người bệnh có thể giảm đáng kể nguy cơ mắc COPD nếu tránh hút thuốc (thuốc lá, thuốc lào). Vì thế nếu bạn đang hút thuốc thì nên dừng lại để có thể ngăn ngừa tổn thương thêm cho phổi trước khi nó bắt đầu gây ra các triệu chứng trầm trọng.\nQuản lý COPD: Người bệnh sẽ được theo dõi định kỳ hàng tháng tại các phòng quản lý Hen, COPD. Tại đây các bác sĩ sẽ kiểm tra chức năng hô hấp, tư vấn và cấp thuốc điều trị dự phòng cho người bệnh.\nNgoài ra, việc tiêm ngừa vắc-xin Cúm hàng năm và vắc-xin phế cầu giúp bạn giảm nguy mắc các đợt bùng phát COPD hiệu quả.\nBệnh viện Đa khoa Quốc tế Vinmec là địa chỉ thăm khám, phòng ngừa và điều trị nhiều bệnh lý hô hấp, trong đó có bệnh phổi tắc nghẽn mãn tính. Việc thực hiện thăm khám, chẩn đoán và điều trị bệnh đều được các bác sĩ có chuyên môn và được đào tạo bài bản cùng với trang thiết bị y tế hiện đại sẽ đem lại kết quả điều trị tối ưu cho người bệnh.\nĐể nâng cao chất lượng dịch vụ cũng như phục vụ yêu cầu chăm sóc sức khỏe toàn diện, hiện nay Vinmec còn triển khai các dịch vụ y tế tiện ích đi kèm như gói tầm soát ung thư phổi, đặc biệt hữu ích với những người bệnh thường xuyên hút và tiếp xúc với thuốc lá hoặc có tiền sử mắc bệnh phổi tắc nghẽn mãn tính cùng nhiều bệnh hô hấp khác."
    },
    {
      "id": 6,
      "name": "Suy tim",
      "images": "https://cdn.nhathuoclongchau.com.vn/unsafe/800x0/filters:quality(95)/https://cms-prod.s3-sgn09.fptcloud.com/benh_suy_tim_cac_bien_chung_suy_tim_va_cach_giam_nhe_chung_1_3a8ff3316d.jpg",
      "reason": "Một số nguyên nhân nền dẫn đến tình trạng này là:\n- Bệnh lý mạch vành như: hội chứng vành cấp, thiếu máu cục bộ cơ tim…\n- Tăng huyết áp;\n- Hẹp van tim: hẹp van động mạch chủ; hẹp van 2 lá\n- Hở van tim: hở van hai lá nặng, hở van động mạch chủ;\n- Bệnh tim bẩm sinh có luồng thông trong tim: thông liên thất, thông liên nhĩ, còn ống động mạch, cửa sổ phế chủ,..\n- Bệnh cơ tim giãn không liên quan với thiếu máu cục bộ:\n- Tiền sử có cái rối loạn về di truyền hoặc trong gia đình có người có tiền sử mắc bệnh;\n- Rối loạn do thâm nhiễm;\n- Tổn thương do thuốc hoặc nhiễm độc;\n- Bệnh chuyển hóa: bệnh lý tuyến giáp, đái tháo đường;\n- Do virus hoặc các tác nhân gây nhiễm trùng khác;\n- Rối loạn nhịp và tần số tim:\n- Rối loạn nhịp chậm mãn tính;\n- Rối loạn nhịp nhanh mạn tính.\nBên cạnh đó, một số yếu tố thúc đẩy khiến tình trạng suy tim trở nặng bao gồm:\n- Chế độ ăn nhiều muối\n- Không tuân thủ điều trị: bỏ thuốc, uống không đều\n- Giảm liều thuốc điều trị suy tim không hợp lý;\n- Rối loạn nhịp (nhanh, chậm);\n- Nhiễm khuẩn;\n- Thiếu máu;\n- Dùng thêm các thuốc có thể làm nặng hơn tình trạng bệnh: chẹn canxi (verapamil, diltiazem), chẹn bêta, kháng viêm không steroid, thuốc chống - loạn nhịp (nhóm I, sotalol);\n- Lạm dụng rượu;\n- Có thai;\n",
      "simpton": "Các biểu hiện khi mắc bệnh có thể khác nhau ở mỗi người. Chúng có thể bắt đầu đột ngột hoặc phát triển dần dần trong nhiều tuần hoặc nhiều tháng.\nCác triệu chứng phổ biến nhất của suy tim là:\n- Khó thở: có thể xảy ra ngay sau khi người bệnh hoạt động hoặc nghỉ ngơi; nặng hơn là khó thở khi nằm đầu thấp, khó thở kịch phát về đêm khiến người bệnh thức dậy.\n- Mệt mỏi: người bệnh có thể cảm thấy mệt mỏi, yếu sức hầu trong hầu hết thời gian;\n- Sưng chân và mắt cá chân: do tình trạng tích nước, có thể nhẹ vào buổi sáng và nặng hơn vào cuối ngày.\nCác triệu chứng khác bao gồm:\n- Ho dai dẳng có thể nặng hơn vào ban đêm; có khi ho ra máu hay bọt hồng\n- Thở khò khè;\n- Đầy hơi;\n- Ăn mất ngon;\n- Tăng cân hoặc sụt cân;\n- Chóng mặt và ngất xỉu;\n- Nhịp tim nhanh, loạn nhịp tim hoặc đánh trống ngực;\n- Một số bệnh nhân cũng có thể cảm thấy trầm cảm và lo lắng, mất ngủ.",
      "revention": "Phương pháp điều trị suy tim\n1. Kiểm soát\n- Giáo dục bệnh nhân về bệnh, quản lý lối sống. Người bệnh cần hiểu về việc theo dõi triệu chứng, thuốc điều trị và lịch hẹn với bác sĩ.\n- Hạn chế Natri\n+ Giảm lượng natri trong chế độ ăn uống là một phần quan trọng trong việc kiểm soát bệnh. Natri có thể gây giữ nước và tăng áp lực trong mạch máu, gây căng thẳng cho tim.\n- Mức cân nặng và tập luyện phù hợp\n+ Người mắc bệnh cần duy trì một trọng lượng cơ thể phù hợp và tham gia vào tập luyện thường xuyên, dưới sự hướng dẫn của bác sĩ hoặc chuyên gia về thể dục.\n- Điều trị bệnh lý căn nguyên\n+ Điều trị các bệnh nền như tăng huyết áp, bệnh mạch vành, tiểu đường, hoặc bệnh thận nếu có, để kiểm soát các nguyên nhân.\n2. Các thiết bị hỗ trợ điều trị\nTrong một số trường hợp, người bệnh có thể cần sử dụng thiết bị hỗ trợ như máy bơm tim, thiết bị giữ mạch vành, hoặc bộ đếm nhịp tim để kiểm soát và điều trị.\n3. Phẫu thuật và các thủ thuật qua da\n- Phẫu thuật bắc cầu động mạch vành\n+ Nếusuy tim có nguyên nhân từ tắc nghẽn mạch vành, phẫu thuật bắc cầu động mạch vành có thể được thực hiện để cải thiện lưu lượng máu đến tim. Trong phẫu thuật này, bác sĩ tạo một con đường đổi máu từ mạch máu không bị tắc nghẽn để đảm bảo máu có thể vượt qua vùng bị tắc nghẽn.\n- Ghép tim\n+ Ghép tim là một phương pháp cuối cùng khi tim suy giảm nghiêm trọng và không thể được điều trị hiệu quả bằng các phương pháp khác. Trong quá trình ghép tim, tim suy giảm được thay thế bằng một tim mới từ nguồn nhà tài trợ."
    },
    {
      "id": 7,
      "name": "Bệnh Parkinson",
      "images": "https://suckhoedoisong.qltns.mediacdn.vn/324455921873985536/2023/12/18/benh-parkinson-170287481789770939764.jpg",
      "reason": "Các nhà khoa học chưa có lý giải về nguyên nhân các tế bào não sản sinh chất dẫn truyền thần kinh bị thoái hóa và chết đi mà chỉ có thể đưa ra một số yếu tố gây bệnh khác nhau như: do tuổi tác (lớn tuổi), do di truyền, do yếu tố môi trường, thậm chí có thể là do virus...",
      "simpton": "Bệnh nhân bị bệnh Parkinson có một số biểu hiện, dấu hiệu  bệnh như sau:\n- Tính cách thay đổi: Do bộ não thường chịu trách nhiệm về suy nghĩ, hành động, nhìn nhận và phản ứng với tình huống, nên bất kỳ thay đổi nào trong tính cách cũng là nguyên nhân sớm của bệnh Parkinson.\n- Phối hợp các hoạt động chậm chạp: đây là một trong những dấu hiệu rõ rệt nhất của bệnh Parkinson khi mới ở giai đoạn đầu. Với các biểu hiện như: bất kỳ thay đổi tư thế như quay đầu, quay người, cài khuy, buộc dây giày... được làm với tốc độ chậm, không rõ ràng.\n- Giảm cảm giác về mùi: ở giai đoạn đầu, bệnh Parkinson thường ảnh hưởng đến khứu giác của con người, làm cho bệnh nhân không có khả năng phân biết mùi của thực phẩm, tình trạng này ngày càng nặng nếu không được chũa trị kịp thời.\n- Các vấn đề về đường ruột: với các dấu hiệu như táo bón hoặc các vấn đề về tiêu hóa phổ biến, đặc biệt với người lớn tuổi.\n- Đau vai: bệnh đau vai kéo dài, kể cả khi có sự can thiệp của y tế như dùng thuốc mà không thuyên giảm là một trong những dấu hiệu của bệnh Parkinson.\n- Mệt mỏi: Biểu hiện mệt mỏi thường xuyên kèm với một trong những dấu hiệu sớm của bệnh Parkinson sẽ là nguy cơ cao của .\n- Có một số thay đổi trong những thói quen sinh hoạt hàng ngày như: thay đổi chữ viết, giọng nói, tính khí thất thường.\n- Một số biểu hiện bệnh dễ dàng gặp phải như: run nhẹ khi bệnh đã tiến triển, gặp vấn đề khi di chuyển, rối loạn giấc ngủ, liệt cơ mặt, ngất xỉu, mất sự cân bằng.",
      "revention": "Các biện pháp phòng ngừa bệnh Parkinson như sau:\n- Tắm nắng thường xuyên để bổ sung đủ vitamin D cho cơ thể. Theo nghiên cứu của các nhà khoa học, hầu hết các bệnh nhân mắc bệnh Parkinson đều có nồng độ Vitamin D thấp.\n- Uống trà xanh hàng ngày có tác dụng ngăn không cho độc tố có thể giết chết tế bào thần kinh thâm nhập vào não.\n- Sử dụng cà phê hợp lý giúp ngăn ngừa nhiều vấn đề sức khỏe, trong đó giúp hạn chế nguy cơ mắc bệnh.\n- Tránh xa môi trường độc hại, đặc biệt thuốc diệt trừ sâu...\n- Bổ sung nguồn dinh dưỡng từ những loại hoa quả giàu flavonoid.\n- Có chế độ tập thể dục khoa học.\nCác biện pháp điều trị bệnh Parkinson\n- Biện pháp để điều trị bệnh Parkinson chủ yếu dựa vào thuốc và luyện tập phục hồi. Trong một số trường hợp phải phẫu thuật não để chữa trị. Đơn thuốc được điều chỉnh dựa vào tình trạng bệnh."
    },
    {
      "id": 8,
      "name": "Hội chứng tiền đình",
      "images": "https://vtv1.mediacdn.vn/2018/3/27/tien-dinh2-15221460643381812693506.jpg",
      "reason": "Hội chứng tiền đình được phân loại thành hai loại là hội chứng tiền đình ngoại vi hoặc hội chứng tiền đình trung ương. Cơ sở của sự phân chia này là tùy thuộc vào vị trí rối loạn chức năng của con đường phản xạ tiền đình. Tuy nhiên, điều này cũng không thể loại trừ được nguyên nhân gây ra hội chứng tiền đình là bởi các yếu tố tâm lý.\n1. Hội chứng tiền đình ngoại vi\n- Hội chứng tiền đình ngoại vi là khi nguyên nhân gây ra bệnh là các vấn đề với tai trong, bao gồm các kênh bán nguyệt, ốc tai và dây thần kinh tiền đình.\n- Chẩn đoán phổ biến nhất là chứng chóng mặt tư thế kịch phát lành tính, chiếm 32% trong tất cả bệnh lý thuộc hội chứng tiền đình ngoại biên. Các nguyên nhân khác bao gồm bệnh Meniere (12%), hội chứng hở ống bán khuyên trên, viêm mê đạo và chóng mặt do thị giác. Ngoài ra, bất kỳ tác nhân gây viêm nào như cảm lạnh thông thường, cúm và nhiễm trùng do vi khuẩn có thể gây ra chứng chóng mặt thoáng qua nếu có ảnh hưởng đến tai trong, kể cả việc có dùng một số thuốc như aminoglycoside hoặc chấn thương thực thể như gãy xương sọ. Nếu tình trạng chóng mặt gây ra bởi chuyển động thì cũng được phân loại là thuộc hội chứng tiền đình ngoại vi.\n- Những người bị chóng mặt ngoại biên thường biểu hiện sự mất cân bằng từ nhẹ đến trung bình, buồn nôn, nôn, giảm thính lực, ù tai, đầy hơi và đau trong tai. Ngoài ra, các tổn thương của kênh thính giác bên trong có thể liên quan đến việc yếu liệt cơ mặt ở cùng một phía. Do khả năng bù trừ, hội chứng tiền đình ngoại vi cấp tính do tổn thương hệ tiền đình ngoại biên có xu hướng cải thiện trong một khoảng thời gian ngắn, từ vài ngày đến vài tuần).\n2. Hội chứng tiền đình trung ương\n- Hội chứng tiền đình trung ương gây chóng mặt là phát sinh do các chấn thương đến những trung tâm cân bằng của hệ thần kinh trung ương. Đây thường là hệ quả của một tổn thương ở não hoặc tiểu não và thường ít gây ảo giác chuyển động hay buồn nôn hơn so với chóng mặt có nguồn gốc ngoại vi.\n- Hội chứng tiền đình trung ương có thể có những khiếm khuyết về thần kinh đi kèm, chẳng hạn như nói chậm và nhìn đôi, và đặc biệt là chứng rung giật nhãn cầu bệnh lý.\n- Một số tình trạng tại hệ thống thần kinh trung ương có thể dẫn đến hội chứng tiền đình trung ương là các tổn thương do nhồi máu hoặc xuất huyết, khối u xuất hiện ở tiểu não, các rối loạn cột sống cổ như thoái hóa đốt sống cổ, hội chứng cột tủy bên, dị tật Chiari, đa xơ cứng, bệnh Parkinson cũng như các rối loạn chức năng não nói chung.\n- So với hội chứng tiền đình ngoại vi, hội chứng tiền đình trung ương thường rất ít cải thiện hoặc có thể cải thiện chậm hơn do các tổn thương thực thể tại não và ít có khả năng bù trừ.",
      "simpton": "Hệ thống tiền đình bao gồm các bộ phận tại tai trong và não giúp kiểm soát sự cân bằng và chuyển động của mắt. Nếu hệ thống này bị tổn thương do bệnh tật, lão hóa hoặc chấn thương, hội chứng rối loạn tiền đình có thể xảy ra với các triệu chứng như sau:\n- Chóng mặt\n- Mất cân bằng và mất phương hướng không gian\n- Rối loạn thị lực\n- Buồn nôn hoặc nôn mửa\n- Cảm giác \"nôn nao\" hay \"say sóng\" trong đầu\n- Nhức đầu\n- Nói lắp\n- Thay đổi thính giác\n- Thay đổi nhận thức\n- Thay đổi tâm lý\n- Các triệu chứng khác như khó tập trung và chú ý, dễ bị phân tâm, dễ quên hay mất trí nhớ ngắn hạn...",
      "revention": "Trước những ảnh hưởng của hội chứng tiền đình đã được nêu ra, bạn có thể tham khảo một số điều dưới đây để chủ động phòng tránh mắc phải căn bệnh này. \n- Không ngồi quá lâu tại một chỗ hoặc trước máy tính.\n- Không đọc sách báo hay dùng máy tính, điện thoại trong lúc đang di chuyển như khi ngồi trên xe ô tô.\n- Cố gắng hạn chế bị căng thẳng, áp lực, lo lắng kéo dài.\n- Khi đứng lên, ngồi xuống hoặc quay cổ quá nhanh và đột ngột. \n- Xây dựng và duy trì thực hiện một lối sống cùng một chế độ ăn uống khoa học, lành mạnh, ngủ đúng giờ và đủ giấc, uống đủ nước mỗi ngày, tránh dùng cafein, chất kích thích.\n- Thường xuyên tập luyện thể dục thể thao vừa sức, tập các bài vận động cho vùng cổ, đầu, gáy. "
    }
  ],
  "savedSicks": [
    {
      "usersId": 1,
      "sicksId": "1",
      "id": 1
    }
  ]
}
